In [4]:
import pandas as pd

In [5]:
pd.__version__

'2.2.2'

In [6]:
import pandas as pd

In [7]:
emp=pd.read_excel(r"C:\Users\nares\Downloads\21st- EDA Practicle\21st- EDA Practicle\EDA- Practicle\Rawdata.xlsx")# path of the raw data

In [8]:
emp

     Name          Domain       Age   Location   Salary      Exp
0    Mike   Datascience#$  34 years     Mumbai   5^00#0       2+
1  Teddy^         Testing    45' yr  Bangalore  10%%000       <3
2   Uma#r  Dataanalyst^^#       NaN        NaN  1$5%000   4> yrs
3    Jane     Ana^^lytics       NaN   Hyderbad   2000^0      NaN
4  Uttam*      Statistics     67-yr        NaN   30000-  5+ year
5     Kim             NLP      55yr      Delhi  6000^$0      10+

In [9]:
id(emp)# identification

1966890158224

In [10]:
emp.columns# to print the attributes

Index(['Name', 'Domain', 'Age', 'Location', 'Salary', 'Exp'], dtype='object')

In [11]:
emp.shape # show rows & columns

(6, 6)

In [12]:
emp.head() # print first 5

     Name          Domain       Age   Location   Salary      Exp
0    Mike   Datascience#$  34 years     Mumbai   5^00#0       2+
1  Teddy^         Testing    45' yr  Bangalore  10%%000       <3
2   Uma#r  Dataanalyst^^#       NaN        NaN  1$5%000   4> yrs
3    Jane     Ana^^lytics       NaN   Hyderbad   2000^0      NaN
4  Uttam*      Statistics     67-yr        NaN   30000-  5+ year

In [13]:
emp.tail() # print last 5

     Name          Domain     Age   Location   Salary      Exp
1  Teddy^         Testing  45' yr  Bangalore  10%%000       <3
2   Uma#r  Dataanalyst^^#     NaN        NaN  1$5%000   4> yrs
3    Jane     Ana^^lytics     NaN   Hyderbad   2000^0      NaN
4  Uttam*      Statistics   67-yr        NaN   30000-  5+ year
5     Kim             NLP    55yr      Delhi  6000^$0      10+

In [14]:
emp.info()# information about the attributes

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 6 entries, 0 to 5
Data columns (total 6 columns):
 #   Column    Non-Null Count  Dtype
---  ------    --------------  -----
 0   Name      6 non-null      object
 1   Domain    6 non-null      object
 2   Age       4 non-null      object
 3   Location  4 non-null      object
 4   Salary    6 non-null      object
 5   Exp       5 non-null      object
dtypes: object(6)
memory usage: 420.0+ bytes

In [15]:
emp.isnull() #show how many null values if any null indicates with (true) other wise (false)

    Name  Domain    Age  Location  Salary    Exp
0  False   False  False     False   False  False
1  False   False  False     False   False  False
2  False   False   True      True   False  False
3  False   False   True     False   False   True
4  False   False  False      True   False  False
5  False   False  False     False   False  False

In [16]:
emp.isnull().sum()

Name        0
Domain      0
Age         2
Location    2
Salary      0
Exp         1
dtype: int64

In [17]:
emp['Name']

0      Mike
1    Teddy^
2     Uma#r
3      Jane
4    Uttam*
5       Kim
Name: Name, dtype: object

In [18]:
emp['Name']=emp['Name'].str.replace(r'\W','',regex=True)# '\w' used to non words char

In [19]:
emp['Name']

0     Mike
1    Teddy
2     Umar
3     Jane
4    Uttam
5      Kim
Name: Name, dtype: object

In [20]:
emp['Name']

0     Mike
1    Teddy
2     Umar
3     Jane
4    Uttam
5      Kim
Name: Name, dtype: object

In [21]:
emp['Domain']

0     Datascience#$
1           Testing
2    Dataanalyst^^#
3       Ana^^lytics
4        Statistics
5               NLP
Name: Domain, dtype: object

In [22]:
emp['Domain']=emp['Domain'].str.replace(r'\W','',regex=True)

In [23]:
emp['Domain']

0    Datascience
1        Testing
2    Dataanalyst
3      Analytics
4     Statistics
5            NLP
Name: Domain, dtype: object

In [24]:
emp['Age']

0    34 years
1      45' yr
2         NaN
3         NaN
4       67-yr
5        55yr
Name: Age, dtype: object

In [25]:
emp['Age']=emp['Age'].str.replace(r'\W','',regex=True)

In [26]:
emp['Age']

0    34years
1       45yr
2        NaN
3        NaN
4       67yr
5       55yr
Name: Age, dtype: object

In [27]:
emp['Age'] = emp['Age'].str.extract(r'(\d+)')

In [28]:
emp['Age']

0     34
1     45
2    NaN
3    NaN
4     67
5     55
Name: Age, dtype: object

In [29]:
emp['Age']

0     34
1     45
2    NaN
3    NaN
4     67
5     55
Name: Age, dtype: object

In [30]:
emp['Salary']

0     5^00#0
1    10%%000
2    1$5%000
3     2000^0
4     30000-
5    6000^$0
Name: Salary, dtype: object

In [31]:
emp['Exp'] = emp['Exp'].str.extract(r'(\d+)')
 #\d used to print only digits (numerical values)

In [32]:
emp['Exp']

0      2
1      3
2      4
3    NaN
4      5
5     10
Name: Exp, dtype: object

In [33]:
emp

    Name       Domain  Age   Location   Salary  Exp
0   Mike  Datascience   34     Mumbai   5^00#0    2
1  Teddy      Testing   45  Bangalore  10%%000    3
2   Umar  Dataanalyst  NaN        NaN  1$5%000    4
3   Jane    Analytics  NaN   Hyderbad   2000^0  NaN
4  Uttam   Statistics   67        NaN   30000-    5
5    Kim          NLP   55      Delhi  6000^$0   10

In [34]:
emp['Salary'] = emp['Salary'].str.extract(r'(\d+)')

In [35]:
emp['Salary']

0        5
1       10
2        1
3     2000
4    30000
5     6000
Name: Salary, dtype: object

In [36]:
emp

    Name       Domain  Age   Location Salary  Exp
0   Mike  Datascience   34     Mumbai      5    2
1  Teddy      Testing   45  Bangalore     10    3
2   Umar  Dataanalyst  NaN        NaN      1    4
3   Jane    Analytics  NaN   Hyderbad   2000  NaN
4  Uttam   Statistics   67        NaN  30000    5
5    Kim          NLP   55      Delhi   6000   10

In [37]:
clean_data=emp.copy()

In [38]:
clean_data

    Name       Domain  Age   Location Salary  Exp
0   Mike  Datascience   34     Mumbai      5    2
1  Teddy      Testing   45  Bangalore     10    3
2   Umar  Dataanalyst  NaN        NaN      1    4
3   Jane    Analytics  NaN   Hyderbad   2000  NaN
4  Uttam   Statistics   67        NaN  30000    5
5    Kim          NLP   55      Delhi   6000   10

In [39]:
clean_data['Age']

0     34
1     45
2    NaN
3    NaN
4     67
5     55
Name: Age, dtype: object

In [40]:
import numpy as np

In [41]:
clean_data['Age']=clean_data['Age'].fillna(np.mean(pd.to_numeric(clean_data['Age'])))

In [42]:
clean_data

    Name       Domain    Age   Location Salary  Exp
0   Mike  Datascience     34     Mumbai      5    2
1  Teddy      Testing     45  Bangalore     10    3
2   Umar  Dataanalyst  50.25        NaN      1    4
3   Jane    Analytics  50.25   Hyderbad   2000  NaN
4  Uttam   Statistics     67        NaN  30000    5
5    Kim          NLP     55      Delhi   6000   10

In [43]:
clean_data['Exp']=clean_data['Exp'].fillna(np.mean(pd.to_numeric(clean_data['Exp'])))

In [44]:
clean_data['Exp']

0      2
1      3
2      4
3    4.8
4      5
5     10
Name: Exp, dtype: object

In [45]:
clean_data

    Name       Domain    Age   Location Salary  Exp
0   Mike  Datascience     34     Mumbai      5    2
1  Teddy      Testing     45  Bangalore     10    3
2   Umar  Dataanalyst  50.25        NaN      1    4
3   Jane    Analytics  50.25   Hyderbad   2000  4.8
4  Uttam   Statistics     67        NaN  30000    5
5    Kim          NLP     55      Delhi   6000   10

In [46]:
clean_data['Location']

0       Mumbai
1    Bangalore
2          NaN
3     Hyderbad
4          NaN
5        Delhi
Name: Location, dtype: object

In [47]:
clean_data['Location']=clean_data['Location'].fillna(clean_data['Location'].mode()[0])# mode always write[0]

In [48]:
clean_data['Location']

0       Mumbai
1    Bangalore
2    Bangalore
3     Hyderbad
4    Bangalore
5        Delhi
Name: Location, dtype: object

In [49]:
clean_data

    Name       Domain    Age   Location Salary  Exp
0   Mike  Datascience     34     Mumbai      5    2
1  Teddy      Testing     45  Bangalore     10    3
2   Umar  Dataanalyst  50.25  Bangalore      1    4
3   Jane    Analytics  50.25   Hyderbad   2000  4.8
4  Uttam   Statistics     67  Bangalore  30000    5
5    Kim          NLP     55      Delhi   6000   10

In [50]:
clean_data['Age']=clean_data['Age'].astype(int) # to show age as int

In [51]:
clean_data.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 6 entries, 0 to 5
Data columns (total 6 columns):
 #   Column    Non-Null Count  Dtype
---  ------    --------------  -----
 0   Name      6 non-null      object
 1   Domain    6 non-null      object
 2   Age       6 non-null      int32
 3   Location  6 non-null      object
 4   Salary    6 non-null      object
 5   Exp       6 non-null      object
dtypes: int32(1), object(5)
memory usage: 396.0+ bytes

In [52]:
clean_data['Exp']=clean_data['Exp'].astype(int)

In [53]:
clean_data.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 6 entries, 0 to 5
Data columns (total 6 columns):
 #   Column    Non-Null Count  Dtype
---  ------    --------------  -----
 0   Name      6 non-null      object
 1   Domain    6 non-null      object
 2   Age       6 non-null      int32
 3   Location  6 non-null      object
 4   Salary    6 non-null      object
 5   Exp       6 non-null      int32
dtypes: int32(2), object(4)
memory usage: 372.0+ bytes

In [54]:
clean_data['Salary']=clean_data['Salary'].astype(int)

In [55]:
clean_data

    Name       Domain  Age   Location  Salary  Exp
0   Mike  Datascience   34     Mumbai       5    2
1  Teddy      Testing   45  Bangalore      10    3
2   Umar  Dataanalyst   50  Bangalore       1    4
3   Jane    Analytics   50   Hyderbad    2000    4
4  Uttam   Statistics   67  Bangalore   30000    5
5    Kim          NLP   55      Delhi    6000   10

In [64]:
clean_data['Name']=clean_data['Name'].astype('category')# it show the which type of data
clean_data['Domain']=clean_data['Domain'].astype('category')
clean_data['Location']=clean_data['Location'].astype('category')

In [65]:
clean_data.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 6 entries, 0 to 5
Data columns (total 6 columns):
 #   Column    Non-Null Count  Dtype
---  ------    --------------  -----
 0   Name      6 non-null      category
 1   Domain    6 non-null      category
 2   Age       6 non-null      int32
 3   Location  6 non-null      category
 4   Salary    6 non-null      int32
 5   Exp       6 non-null      int32
dtypes: category(3), int32(3)
memory usage: 866.0 bytes

In [66]:
clean_data.to_csv('clean_data.csv')

In [67]:
import os# to save the the cleaning data in ur os
os.getcwd()

'D:\\data science'

In [68]:
clean_data

    Name       Domain  Age   Location  Salary  Exp
0   Mike  Datascience   34     Mumbai       5    2
1  Teddy      Testing   45  Bangalore      10    3
2   Umar  Dataanalyst   50  Bangalore       1    4
3   Jane    Analytics   50   Hyderbad    2000    4
4  Uttam   Statistics   67  Bangalore   30000    5
5    Kim          NLP   55      Delhi    6000   10